# LinePattern Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LinePattern Constructor
LinePattern Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LinePattern()()()() | Creates a simple line pattern. |
| LinePattern(String) | Creates a line pattern with given name. |

# See Also
LinePattern Class
LinePattern Members
Autodesk.Revit.DB Namespace